<template lang="pug">

    .about.wrp
        h1.about__title.h1 Описание работы
        p.about__text
            | Все требования выполнены. Надеюсь ничего не забыл.
            br
            br
            | Для работы я использовал Sass и различные миксины для него. В папке sass лежит укороченная версия общих настроек стилей для любых проектов.
            br
            br
            | Спеуиально НЕ использовал scoped в стилях, так так на сколько я знаю он может тормозить сайт. Вместо этого делал все по БЭМ-у.
            br
            br
            | Также я привык пользоваться шаблонизатором Pug и дополнением Bemto (помощник для написания по БЭМ-у), в качестве примера я использовал это в некоторых компонентах.
            br
            br
            | Использовал в работе Vue-cli, Vuex, Vuex-persistedstate для сохранения состояния после перезагрузки страницы.

</template>

<style lang="sass">

    .about
        &__title
            margin-bottom: 40px
        &__text
            font-size: 20px
    
</style>